practice-for-ch-rails-first-routes-long-practice-main/first_routes/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 2], ["viewer_id", 1], ["created_at", "2023-04-13 19:30:57.522946"], ["updated_at", "2023-04-13 19:30:57.522946"]]
---
    def create
        # debugger
        artwork_shares = ArtworkShare.new(artwork_shares_params)
        if artwork_shares.save!

DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 5]]
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def destroy
        ArtworkShare.find(params[:id]).destroy