practice-for-ch-rails-first-routes-long-practice-main/first_routes/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
  def index
      render json: Artwork.all