practice-for-ch-rails-first-routes-long-practice-main/first_routes/app/controllers/artworks_controller.rb

SELECT DISTINCT "artworks"."title" FROM "users" INNER JOIN "artwork_shares" ON "artwork_shares"."viewer_id" = "users"."id" INNER JOIN "artworks" ON "artworks"."id" = "artwork_shares"."artwork_id" WHERE "artworks"."artist_id" = $1  [["artist_id", 3]]
SELECT DISTINCT "artworks"."title" FROM "users" INNER JOIN "artwork_shares" ON "artwork_shares"."viewer_id" = "users"."id" INNER JOIN "artworks" ON "artworks"."id" = "artwork_shares"."artwork_id" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 3]]
---
  def artworks_for_user_id
    results = []
    # debugger
    results.concat(User.select('artworks.title').distinct.joins(:shares).where(artworks: {artist_id: params[:user_id]}))
    results.concat(User.select('artworks.title').joins(:shares).where(artwork_shares: {viewer_id: params[:user_id]}))

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "The Last Supper"], ["image_url", "www.thelastsupper.com"], ["artist_id", 2], ["created_at", "2023-04-13 15:59:07.879601"], ["updated_at", "2023-04-13 15:59:07.879601"]]
---
  def create
    # debugger
    artwork = Artwork.new(artwork_params)
    if artwork.save!

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    render json: Artwork.find(params[:id])

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Dogs Playing Poker"], ["updated_at", "2023-04-13 18:52:59.947227"], ["id", 2]]
---
  def update
    @artwork = Artwork.find(params[:id])
    # debugger
    if @artwork.update(artwork_params)

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 2]]
---
  def destroy
    Artwork.find(params[:id]).destroy