practice-for-ch-rails-first-routes-long-practice-main/first_routes/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        # render plain: "I'm in the index action!"
        # @users = User.all
        render json: User.all

INSERT INTO "users" ("created_at", "updated_at", "name", "email") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2023-04-12 20:29:27.412172"], ["updated_at", "2023-04-12 20:29:27.412172"], ["name", "Spencer"], ["email", "spencer@gmail.com"]]
---
    def create
        # debugger
        user = User.new(params.require(:user).permit(:name, :email))
        if user.save!

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        render json: User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "name" = $2, "email" = $3 WHERE "users"."id" = $4  [["updated_at", "2023-04-12 21:07:22.365782"], ["name", "tony"], ["email", "tony@gmail.com"], ["id", 2]]
---
    def update
        @user = User.find(params[:id])
        debugger
        if @user.update(params.require(:user).permit(:name, :email))